/**
  *****************************************************************************
  * @file    : sleep.c
  * @author  : Tuu
  * @version : 1.0.0
  * @date    : 2021-03-13
  * @brief   : stc8 sleep api
  ******************************************************************************
  * @lasteditors  : Tuu
  * @lasteditTime : 2021-03-13
  ******************************************************************************
  * @atten   : Copyright (C) by Tuu Inc
  *
  *****************************************************************************
  */

/* Includes -------------------------------------------------------------------*/
#include "sleep.h"

#include "STC8HX.h"

/* Defines --------------------------------------------------------------------*/
#define EX2 0x10
#define EX3 0x20
#define EX4 0x40

/* Variables ------------------------------------------------------------------*/

/* Functions ------------------------------------------------------------------*/

void sys_enter_sleep(void)
{
    IE0 = 0;    //外中断0标志位
    // IE1 = 0;    //外中断1标志位

    EX0 = 1;    //INT0 Enable
    EX1 = 1;    //INT1 Enable

    IT0 = 1;        //INT0 下降沿中断
    // IT0 = 0;        //INT0 上升,下降沿中断
    IT1 = 1;        //INT1 下降沿中断
    // IT1 = 0;        //INT1 上升,下降沿中断

    INTCLKO = EX2;      //使能 INT2 下降沿中断
    INTCLKO |= EX3;     //使能 INT3 下降沿中断
    // INTCLKO |= EX4;  //使能 INT4 下降沿中断

    PCON |= 0x02;   //Sleep
    _nop_();
    _nop_();
    _nop_();
}

/********************* INT0中断函数 *************************/
void INT0_int(void) interrupt 0      //进中断时已经清除标志
{
    EX0 = 0;    //INT0 Disable
    IE0 = 0;    //外中断0标志位
}

/********************* INT1中断函数 *************************/
void INT1_int(void) interrupt 2      //进中断时已经清除标志
{
    EX1 = 0;    //INT1 Disable
    IE1 = 0;    //外中断1标志位
}

/********************* INT2中断函数 *************************/
void INT2_int(void) interrupt 10     //进中断时已经清除标志
{
    INTCLKO &= ~EX2;    //INT2 Disable
}

/********************* INT3中断函数 *************************/
void INT3_int(void) interrupt 11     //进中断时已经清除标志
{
    INTCLKO &= ~EX3;    //INT3 Disable
}

/********************* INT4中断函数 *************************/
void INT4_int(void) interrupt 16     //进中断时已经清除标志
{
    INTCLKO &= ~EX4;    //INT4 Disable
}

/************************ (C) COPYRIGHT Tuu ********END OF FILE****************/

